[
  {
    "title": "✈️ Preliminary Report: Mid-Air Collision Over Washington, D.C. (January 29, 2025)",
    "summary": "On January 29, 2025, American Eagle Flight 5342 (CRJ700) and a U.S. Army Black Hawk helicopter collided mid-air while approaching Ronald Reagan Washington National Airport. All 67 people aboard both aircraft perished.",
    "image": "photos/crj700_accident.webp",
    "alt": "CRJ700 and Black Hawk Collision",
    "details": "\n<p><strong>Flight Details</strong></p>\n<ul>\n  <li><strong>Airliner:</strong> Bombardier CRJ700 (Flight 5342)</li>\n  <li><strong>Operator:</strong> PSA Airlines for American Eagle</li>\n  <li><strong>Origin:</strong> Wichita Dwight D. Eisenhower National Airport (ICT)</li>\n  <li><strong>Destination:</strong> Ronald Reagan Washington National Airport (DCA)</li>\n  <li><strong>Occupants:</strong> 64 (60 passengers, 4 crew)</li>\n  <li><strong>Helicopter:</strong> Sikorsky UH-60L Black Hawk (3 crew members)</li>\n</ul>\n\n<p><strong>Key Events</strong></p>\n<ul>\n  <li>Collision occurred ~8:47 PM EST at 300 ft altitude near Runway 33.</li>\n  <li>Black Hawk accepted visual separation but may have misidentified traffic.</li>\n  <li>Stepped-on radio transmission possibly prevented a “pass behind” command from being heard.</li>\n  <li>Helicopter exceeded its 200 ft ceiling for the airspace corridor.</li>\n</ul>\n\n<p><strong>Contributing Factors</strong></p>\n<ul>\n  <li>Miscommunication and incomplete radio contact</li>\n  <li>Conflicting cockpit altimeter readings</li>\n  <li>Reduced visibility due to night vision goggles (NVGs)</li>\n  <li>Airspace congestion and misidentification of aircraft</li>\n</ul>\n\n<p><strong>Aftermath</strong></p>\n<ul>\n  <li>Reagan National Airport temporarily shut down</li>\n  <li>FAA restricted military helicopter corridors near DCA</li>\n  <li>Black boxes recovered; full NTSB report expected in 2026</li>\n</ul>\n\n<p>This incident is the deadliest U.S. aviation disaster since 2001 and the first fatal crash involving a CRJ700. The tragedy has prompted calls for regulatory reform and tighter integration of military and civilian airspace operations.</p>\n"
  },
  {
    "title": "🌱 Airbus Unveils ZEROe: The Future of Hydrogen-Powered Flight",
    "summary": "Airbus has introduced its ZEROe concept aircraft, marking a major step toward zero-emission aviation. The project aims to launch the world’s first hydrogen-powered commercial airliner by 2035.",
    "image": "photos/airbus_zero_e.jpg",
    "alt": "Airbus ZEROe Hydrogen Aircraft Concept",
    "details": "\n<p><strong>What is ZEROe?</strong></p>\n<p>ZEROe is Airbus’s bold initiative to develop the world’s first <strong>zero-emission commercial aircraft</strong> powered by hydrogen. The company revealed three concept aircraft designs that could serve different market needs—all using hydrogen as their primary fuel source.</p>\n\n<p><strong>Concept Aircraft:</strong></p>\n<ul>\n  <li><strong>Turbofan:</strong> A 120–200 passenger jet with a range of over 2,000 nautical miles.</li>\n  <li><strong>Turboprop:</strong> A 100-passenger aircraft ideal for short-haul regional travel.</li>\n  <li><strong>Blended-Wing Body:</strong> A futuristic wide-body concept with increased cabin flexibility and efficiency.</li>\n</ul>\n\n<p><strong>Why Hydrogen?</strong></p>\n<ul>\n  <li>Hydrogen produces <strong>zero CO₂ emissions</strong> when used in fuel cells.</li>\n  <li>Can reduce aircraft climate impact by up to 75% compared to current fuels.</li>\n  <li>Hydrogen infrastructure is growing globally, aligning with green energy goals.</li>\n</ul>\n\n<p><strong>Challenges Ahead:</strong></p>\n<ul>\n  <li>Requires complete redesign of aircraft fuel systems and storage tanks.</li>\n  <li>Needs major investment in airport hydrogen refueling infrastructure.</li>\n  <li>Technology and safety standards must evolve to support mass production.</li>\n</ul>\n\n<p><strong>Launch Target:</strong> Airbus aims to enter service with a ZEROe aircraft by <strong>2035</strong>, potentially reshaping the commercial aviation industry.</p>\n\n<p>This initiative positions Airbus at the forefront of sustainable aviation, signaling a major shift toward climate-conscious aircraft design in the decades to come.</p>\n"
  },
  {
    "title": "🔍 MH370: New Investigation Launched Into Missing Aircraft",
    "summary": "More than a decade after Malaysia Airlines Flight MH370 vanished, authorities have reopened the investigation, citing new satellite and ocean drift data that could narrow the search zone.",
    "image": "photos/mh370.jpg",
    "alt": "Malaysia Airlines MH370 Investigation Reopens",
    "details": "\n<p><strong>Background:</strong></p>\n<p>Malaysia Airlines Flight MH370 disappeared on <strong>March 8, 2014</strong>, en route from Kuala Lumpur to Beijing, with <strong>239 people on board</strong>. Despite international search efforts, the aircraft has never been found, making it one of the greatest aviation mysteries of all time.</p>\n\n<p><strong>Why the Case is Reopening:</strong></p>\n<ul>\n  <li>New satellite technology and ocean current models suggest a more precise search area in the Indian Ocean.</li>\n  <li>Private exploration firm Ocean Infinity has offered to resume the search using advanced autonomous vehicles.</li>\n  <li>Malaysian officials have signaled support, pending the strength of the new data.</li>\n</ul>\n\n<p><strong>Key Theories Under Review:</strong></p>\n<ul>\n  <li>Possible deliberate course deviation by the pilot or hijacking.</li>\n  <li>Catastrophic electrical or mechanical failure causing a communications blackout.</li>\n  <li>Loss of cabin pressure and hypoxia affecting crew and passengers.</li>\n</ul>\n\n<p><strong>Past Efforts:</strong></p>\n<ul>\n  <li>Initial search efforts covered over 120,000 square kilometers of ocean floor.</li>\n  <li>Some debris was recovered along African coastlines and Indian Ocean islands.</li>\n  <li>The official search was suspended in 2018 after no conclusive wreckage was found.</li>\n</ul>\n\n<p><strong>Families and Experts React:</strong></p>\n<p>The reopening has been met with cautious optimism by families of victims and aviation experts, many of whom have long believed that critical data was left unexplored. A successful new search could finally provide closure after more than a decade of uncertainty.</p>\n\n<p><strong>Next Steps:</strong> Authorities are expected to review Ocean Infinity’s proposal and may authorize a new deep-sea mission as early as <strong>late 2025</strong>.</p>\n"
  }
]